<template>
  <div id="PrivacyPolicy">
    <top-header :title="title" :left="leftBtn" :right="rightBtn"></top-header>
    <v-container>
      <v-row justify="space-around">
        <v-card elevation="2" max-width="90vw">
          <v-card-text>
            <p>電動バイク支援アプリ『e-xross』</p>
            <p>プライバシーポリシー</p>
            <h3>第1条 定義</h3>
            <ol>
              <li>本プライバシーポリシー</li>
              <p>
                本アプリ（次号で定めます。）に関するアプリケーション・プライバシーポリシーをいいます。
              </p>
              <li>本アプリ</li>
              <p>
                電動バイク支援アプリ『e-xross(イークロス)』をいい、コンピュータープログラム、アイコンおよびデザイン等のコンテンツ、マニュアルおよび関連資料のすべてをいいます。
              </p>
              <li>本サービス</li>
              <p>
                本アプリ管理者側（以下、「当方」といいます。）が、本アプリを通じて提供するサービスをいいます。
              </p>
              <li>e-xross ID</li>
              <p>
                本アプリを使用するために必要な識別用の符号をいい、アプリを初めて起動する際にユーザーが入力するものをいいます。
              </p>
            </ol>
            <h3>第2条 同意</h3>
            <p>
              ユーザーは、本アプリおよび本サービスのご利用にあたり、本プライバシーポリシーおよび使用許諾契約の内容をご確認いただき、これらに同意するものとします。これらに同意されない場合には、本アプリおよび本サービスをご利用になれません。
            </p>
            <h3>第3条 取得される情報</h3>
            <p>
              当方は、本アプリおよび本サービスの提供等にあたり、以下の情報を取得します。
            </p>
            <ol>
              <li>
                アカウント情報（e-xross ID、名前、パスワード、自己紹介等）
              </li>
              <li>「友だち」のユーザーのe-xross ID</li>
              <li>
                「友だち申請」をしているまたはされているユーザーのe-xross ID
              </li>
              <li>位置情報</li>
              <li>当社が、最後に前各号の情報を取得した日時</li>
              <li>お問い合わせされる場合に限り、ユーザーのメールアドレス</li>
            </ol>
            <h3>第4条 取得される情報の利用目的</h3>
            <p>
              当方は、第3条で記載した情報を、以下の利用目的のために取得します。
            </p>
            <ol>
              <li>本サービスを提供するため</li>
              <li>本アプリおよび本サービスの改善・不具合修正に役立てるため</li>
              <li>本サービスの利用状況について分析や統計をおこなうため</li>
              <li>
                ユーザーからの問い合わせの対応またはその他のユーザーサポートを実施するため
              </li>
            </ol>
            <h3>第5条 利用者関与の方法</h3>
            <p>
              第3条に定めるユーザー情報の自動取得は、以下のいずれかの方法によって停止することができます。
            </p>
            <ol>
              <li>ユーザー端末の電源を切る。</li>
              <li>ユーザー端末の通信機能をオフにする。</li>
              <li>ユーザー端末において本アプリをアンインストールする。</li>
              <li>
                『設定』アプリまたは自動で表示されるアラートで、位置情報の利用を「なし」にする。
              </li>
            </ol>
            <h3>第6条 取得された情報の公開、共有</h3>
            <p>
              ユーザーのアカウント情報（e-xross
              ID、名前、自己紹介等）は、常に公開されます。
            </p>
            <p>
              以下の各号の場合には、該当のユーザーに紐づいたアカウントに対して、情報が共有されます。
            </p>
            <ol>
              <li>ユーザーが活動記録を作成した場合</li>
              <li>
                「友だち」のユーザーが活動記録を作成し、公開設定とした場合
              </li>
            </ol>
            <h3>第7条 問い合わせ窓口</h3>
            <p>
              本アプリおよび本サービスにおけるユーザー情報の取り扱いに関するお問い合わせ、ご相談は以下の窓口でお受けいたします。
            </p>
            <ul>
              <li>窓口名称: e-xrossサポート</li>
              <li>メールアドレス: ryohei.kure@gmail.com</li>
            </ul>
            <h3>第8条 変更</h3>
            <p>本プライバシーポリシーは改定されることがあります。</p>
            <p>
              取得される情報の変更や追加、利用目的の変更、第三者提供等について変更がある場合には、インストール前もしくはインストール時に改めて同意を取得させていただきます。
            </p>
          </v-card-text>
        </v-card>
      </v-row>
    </v-container>
  </div>
</template>

<script>
// import TopFooter from "@/components/TopFooter.vue";
import TopHeader from "@/components/TopHeader.vue";

export default {
  data() {
    return {
      /**
       * //component data
       */
      title: "プライバシーポリシー",
      leftBtn: {},
      rightBtn: {},
      /**
       * //methods data
       */
    };
  },
  computed: {},
  methods: {},
  watch: {},
  beforeCreate() {},
  mounted() {},
  components: { TopHeader },
};
</script>

<style lang="scss"></style>
