<template>
  <div id="UseagePolicy">
    <top-header :title="title" :left="leftBtn" :right="rightBtn"></top-header>
    <v-container>
      <v-row justify="space-around">
        <v-card elevation="2" max-width="90vw">
          <v-card-text>
            <p>電動バイク支援アプリ『e-xross』</p>
            <p>使用許諾契約</p>
            <h3>第1条 定義</h3>
            <ol>
              <li>本契約</li>
              <p>
                本アプリ（次号に定めます。）を利用するユーザーと、本アプリ管理者側（以下「当方」といいます。）との契約をいいます。
              </p>
              <li>本アプリ</li>
              <p>
                電動バイク支援アプリ『e-xross（イークロス）』をいい、コンピュータープログラム、アイコンおよびデザイン等のコンテンツ、マニュアルおよび関連資料のすべてをいいます。
              </p>
              <li>本サービス</li>
              <p>
                本アプリ管理者側が、本アプリを通じて提供するサービスをいいます。
              </p>
            </ol>
            <h3>第2条 同意</h3>
            <p>
              ユーザーは、本アプリおよび本サービスのご利用にあたり、本契約およびプライバシーポリシーの内容をご確認いただき、これらに同意するものとします。これらに同意されない場合には、本アプリおよび本サービスをご利用になれません。
            </p>
            <h3>第3条 使用許諾条件</h3>
            <p>
              当方は、本契約に定めるところにより、本アプリを、一つのモバイル・デバイスにおいて、非営利目的のために導入および使用する非独占的かつ譲渡不可の限定的な使用権を、ユーザーに許諾します。
            </p>
            <h3>第4条 ユーザーのデータ使用</h3>
            <p>
              ユーザーから取得するすべてのデータは、プライバシーポリシーに従って取得、保存、公開および共有されます。本契約に同意される際には、必ずプライバシーポリシーをお読みください。ユーザーが本契約に同意された時点で、プライバシーポリシーにも同意されたものとみなします。
            </p>
            <h3>第5条 禁止事項</h3>
            <p>ユーザーが以下の各号の行為をおこなうことは禁止いたします。</p>
            <ol>
              <li>
                他のユーザーに不快感を与える行為、または他のユーザーおよびその他の第三者の信用または名誉を毀損する行為
              </li>
              <li>他のユーザーに成りすます行為</li>
              <li>
                本アプリの使用権を第三者に貸与、譲渡、リース、レンタル、サブライセンスする行為
              </li>
              <li>
                本アプリを複製、改変、翻案または他のアプリケーションと結合する行為
              </li>
              <li>
                本アプリを逆アセンブル、逆コンパイル、または他の方法のリバースエンジニアリングをおこなう行為
              </li>
              <li>
                本アプリおよび本サービスの内容、アイコンおよびデザイン等のコンテンツに含まれる知的財産権を侵害する行為
              </li>
              <li>
                宗教、人種、性、民族、人権およびその他のあらゆる偏見による信条をもった行動に利用する行為
              </li>
              <li>
                国際法、憲法、法律、条例、その他の法令に抵触する行為およびそのおそれのある行為
              </li>
              <li>
                犯罪に結びつく、またはこれを教唆、ほう助する、またはそのおそれのある行為
              </li>
              <li>性行為およびわいせつな行為を目的とする行為</li>
              <li>
                不正な手段等を用いて入手したアカウント情報および個人情報を第三者に開示または提供する行為
              </li>
              <li>
                前各号の事項以外の、当方に支障を与えたまたは与える可能性のある行為
              </li>
              <li>
                その他、当方が禁止行為であると判断し、ユーザーに通知または公表した行為
              </li>
            </ol>
            <ol>
              <p>
                ユーザーが禁止行為をおこなったと当方が判断した場合、ユーザーは本契約の重大な違反をしたとみなされ、直ちに以下の措置をおこないます。
              </p>

              <li>ユーザーに対して注意または警告</li>
              <li>ユーザーが扱うデータの削除</li>
              <li>本アプリの利用の全部または一部の一時または永久の停止</li>
              <li>ユーザーのアカウントの削除</li>
            </ol>
            <p>
              なお、当方は、ユーザーに通知、理由の説明または開示をおこなわず、これらの措置をおこなうことができるものとします。
            </p>

            <h3>第6条 本契約の解約</h3>
            <p>
              本契約は解約されるまで有効とします。以下の各号の場合には、本契約に基づくユーザーの権利は、当方から通知なしに直ちに解約されるものとします。解約により直ちに、ユーザーは本アプリの使用を中止し、削除しなければならないものとします。
            </p>
            <ol>
              <li>
                ユーザーが本契約の契約条件（第5条に含める禁止行為を含みますが、この限りではありません。）のいずれかを遵守されない場合
              </li>
              <li>
                ユーザーが本アプリを最後に利用した日から1年間以上が経過した場合
              </li>
            </ol>
            <h3>第7条 本アプリの変更・終了・中断等</h3>
            <ol>
              <li>本アプリの変更</li>
              <p>
                当方は、ユーザーに事前に通知することなく、本アプリおよび本サービスの一部を変更または追加することができるものとします。
              </p>
              <li>本アプリの終</li>
              <p>
                当方は、事前に、本アプリ上への提示または当方が適切と判断する方法でユーザーに通知することにより、本アプリの提供を終了することができるものとします。
              </p>
              <li>本アプリの中断</li>
              <p>
                当方は、以下の各号の事由が生じた場合には、ユーザーに事前に通知することなく、本サービスの全部または一部を一時的に中断することができるものとします。
              </p>
              <ol>
                <li>
                  本アプリに関わるメンテナンスや修理を定期的または緊急におこなう場合
                </li>
                <li>
                  アクセス過多、その他の予期せぬ要因でシステムに負荷が集中した場合
                </li>
                <li>ユーザーのセキュリティを確保する必要が生じた場合</li>
                <li>
                  地震、水害等の天災、火災、停電、その他の不慮の事故または紛争、戦争、動乱、暴動等の不可抗力により本サービスの提供が困難な場合
                </li>
                <li>
                  法令またはこれに基づく措置により本サービスの提供が不可能となった場合
                </li>
                <li>その他、当方が必要と判断した場合</li>
              </ol>
            </ol>
            <h3>第8条 ユーザーの責任</h3>
            <p>
              ユーザーは、ユーザー自身の責任と費用負担において本アプリおよび本サービスを利用するものとし、その利用に際しておこなったすべての行為およびその結果について一切の責任を負うものとします。
            </p>
            <h3>第9条 免責</h3>
            <ol>
              <li>
                当方は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティに関する欠陥、エラーやバグ、権利侵害等を含みます。）がないことを、明示的にも黙示的にも保証しておりません。当方は、かかる瑕疵を除去して本サービスを提供する義務を負いません。
              </li>
              <li>
                当方は、本サービスの利用や提供、これらの変更、停止、中断、もしくはシステムの不具合を含む利用中の事故、その他本サービスに起因してユーザーまたは第三者に生じたあらゆる障害について、一切の責任を負いません。ただし、本サービスに関する当方とユーザー間との契約（本契約を含みます。）が消費者契約法に定める消費者契約となる場合、この免責規定は適用されません。
              </li>
              <li>
                前項ただし書に定める場合であっても、当方は、当方の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた障害（当社またはユーザーが損害発生につき予見し、または予見し得た場合を含みます。）について、一切の責任を負いません。
              </li>
              <li>
                当方は、本サービスに関して、ユーザーと他のユーザーまたはその他の第三者との間において生じた取引、連絡または紛争等について、一切責任を負いません。
              </li>
            </ol>
            <h3>第10条 本サービスの譲渡等の場合の取り扱い</h3>
            <p>
              当方が、本サービスを第三者に譲渡もしくは承継させたときは、当方は、本契約上の地位、権利、義務およびユーザー情報を当該譲渡の譲受人に承継させることができるものとし、ユーザーは、かかる譲渡等につき本条においてあらかじめ同意したものとみなします。
            </p>
            <h3>第11条 分離可能性</h3>
            <p>
              本契約のいずれかの条項またはその一部が無効または執行不能と判断された場合であっても、当該判断は他の部分に影響を及ぼさず、残りの部分は、引き続き完全に有効かつ執行力を有するものとします。当方およびユーザーは、無効もしくは執行不能とされた条項または部分の趣旨に従い、これと同等の効果を確保できるように努めるとともに、修正された規約に拘束されることに同意するものとみなします。
            </p>
            <h3>第12条 変更</h3>
            <p>本契約は改定されることがあります。</p>
            <p>
              取得される情報の変更や追加、利用目的の変更、第三者提供等について変更がある場合には、インストール前もしくはインストール時に改めて同意を取得させていただきます。
            </p>
            <h3>第13条 準拠法</h3>
            <p>本契約の解釈にあたっては、日本法を準拠法とします。</p>
          </v-card-text>
        </v-card>
      </v-row>
    </v-container>
  </div>
</template>

<script>
import TopHeader from "@/components/TopHeader.vue";

export default {
  data() {
    return {
      /**
       * //component data
       */
      title: "使用許諾",
      leftBtn: {},
      rightBtn: {},
      /**
       * //methods data
       */
    };
  },
  computed: {},
  methods: {},
  watch: {},
  beforeCreate() {},
  mounted() {},
  components: {
    TopHeader,
  },
};
</script>

<style lang="scss"></style>
